In [26]:
import pandas as pd
import numpy as np

In [8]:
data = pd.read_csv("~/data/mlopen/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [10]:
data.sex.value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

In [12]:
data[data.sex == "Female"]["age"].mean()

36.85823043357163

In [24]:
data["native-country"].value_counts(normalize = True).sort_index()["Germany"]

0.004207487485028101

In [27]:
data.groupby(["salary"])["age"].agg([np.mean, np.std])

             mean        std
salary
<=50K   36.783738  14.020088
>50K    44.249841  10.519028

In [28]:
pd.crosstab(data.salary, data.education)

education,10th,11th,12th,1st-4th,5th-6th,7th-8th,9th,Assoc-acdm,Assoc-voc,Bachelors,Doctorate,HS-grad,Masters,Preschool,Prof-school,Some-college
salary,,,,,,,,,,,,,,,,
<=50K,871,1115,400,162,317,606,487,802,1021,3134,107,8826,764,51,153,5904
>50K,62,60,33,6,16,40,27,265,361,2221,306,1675,959,0,423,1387

In [29]:
data.groupby(["sex", "race"])['age'].describe()

                             count       mean        std   min   25%   50%  \
sex    race
Female Amer-Indian-Eskimo    119.0  37.117647  13.114991  17.0  27.0  36.0
       Asian-Pac-Islander    346.0  35.089595  12.300845  17.0  25.0  33.0
       Black                1555.0  37.854019  12.637197  17.0  28.0  37.0
       Other                 109.0  31.678899  11.631599  17.0  23.0  29.0
       White                8642.0  36.811618  14.329093  17.0  25.0  35.0
Male   Amer-Indian-Eskimo    192.0  37.208333  12.049563  17.0  28.0  35.0
       Asian-Pac-Islander    693.0  39.073593  12.883944  18.0  29.0  37.0
       Black                1569.0  37.682600  12.882612  17.0  27.0  36.0
       Other                 162.0  34.654321  11.355531  17.0  26.0  32.0
       White               19174.0  39.652498  13.436029  17.0  29.0  38.0

                             75%   max
sex    race
Female Amer-Indian-Eskimo  46.00  80.0
       Asian-Pac-Islander  43.75  75.0
       Black               46.00  90.0
       Other               39.00  74.0
       White               46.00  90.0
Male   Amer-Indian-Eskimo  45.00  82.0
       Asian-Pac-Islander  46.00  90.0
       Black               46.00  90.0
       Other               42.00  77.0
       White               49.00  90.0

In [30]:
data.age[data.race == "Amer-Indian-Eskimo"].max()

82

In [35]:
data["status"] = (data["marital-status"].str.startswith("Married")).astype("int")

In [39]:
pd.crosstab(data.status[data.sex == "Male"], 
            data.salary[data.sex == "Male"],
           normalize = True)

salary             <=50K      >50K
marital-status
0               0.346581  0.031987
1               0.347682  0.273749

In [40]:
data["hours-per-week"].max()

99

In [45]:
data[data["hours-per-week"] == data["hours-per-week"].max()].shape[0]

85

In [48]:
data[data["native-country"] == "Japan"].pivot_table(["hours-per-week"], ["salary","native-country"], aggfunc = "mean")

                       hours-per-week
salary native-country
<=50K  Japan                41.000000
>50K   Japan                47.958333